import 'package:flutter/foundation.dart';
import 'package:flutter/material.dart';
import 'package:magazines/category.dart';
import 'text&photo.dart';

import 'headlines.dart';

class HomeScreen extends StatelessWidget {
  static const String RouteName = 'home';
  List<CategoryData>data = [
    CategoryData(title: ' مجلة السياسة', Image: 'assets/images/policy.jpg',discrib:"السياسة هي فن إدارة شؤون الدولة والمجتمع، وهي تتعلق بكيفية اتخاذ القرارات التي تؤثر في حياة الناس وتوجيه موارد الدولة. تشمل السياسة العلاقات بين الحكومات، وكذلك تفاعلات الأفراد والمؤسسات داخل المجتمع. تُعتبر الديمقراطية أحد أشكال السياسة التي تتيح للشعب المشاركة في صنع القرارات عبر الانتخابات. بينما تركز الأنظمة الاستبدادية على تركيز السلطة في يد القائد أو الحكومة. تلعب السياسة دورًا حيويًا في تحقيق الاستقرار والعدالة، ولكنها قد تؤدي أيضًا إلى صراعات وتوترات بين القوى المختلفة في المجتمع " ),
    CategoryData(title: 'مجلة التكنولوجيا', Image: 'assets/images/tecnology.jpg',discrib:"التكنولوجيا هي مجموعة من الأدوات والتقنيات التي تم تطويرها لتحسين حياة الإنسان وتسهيل مهامه اليومية. بدأت مع اختراع الأدوات البسيطة وتطورت مع مرور الوقت لتشمل أجهزة الكمبيوتر والإنترنت والذكاء الاصطناعي. أحدثت التكنولوجيا ثورة في مجالات مثل الاتصالات، التعليم، الطب، والصناعة، حيث جعلت المعلومات أكثر توافرًا وساهمت في تحسين الإنتاجية. رغم فوائدها العديدة، فإن التكنولوجيا تطرح تحديات مثل فقدان الخصوصية وزيادة الاعتماد على الأجهزة. تظل التكنولوجيا قوة محورية في تقدم المجتمعات، مما يعكس دورها الحيوي في العصر الحديث" ),
    CategoryData(title: "مجلة الرياضة", Image: 'assets/images/sport.jpg',discrib:"الرياضة هي نشاط بدني يمارسه الأفراد لتحسين لياقتهم البدنية والصحية، كما تعد وسيلة للتسلية والترفيه. تلعب الرياضة دورًا مهمًا في تعزيز الروح الجماعية والروح الرياضية، حيث تجمع بين الأفراد من مختلف الأعمار والخلفيات الثقافية. تشمل الرياضة العديد من الأنواع مثل كرة القدم، السباحة، والتنس، مما يسمح بتنوع الأنشطة التي يمكن ممارستها. تساعد الرياضة على تقوية الجسم والعقل، وتقلل من مخاطر الأمراض المزمنة مثل السكري وأمراض القلب. إلى جانب ذلك، تشجع الرياضة على الانضباط والالتزام، مما يجعلها جزءًا أساسيًا من حياة الإنسان المعاصر" ),
    CategoryData(title: 'مجلة السياحة', Image: 'assets/images/tourism.jpg',discrib: "السياحة هي نشاط يقوم به الأفراد لزيارة أماكن جديدة بغرض الترفيه أو الاستكشاف أو الاستجمام. تعد السياحة مصدرًا هامًا للدخل للكثير من البلدان، حيث تساهم في تنمية الاقتصاد المحلي وتوفير فرص العمل. تشمل السياحة العديد من الأنواع مثل السياحة الثقافية، الشاطئية، والطبيعية، مما يجعلها مجالًا واسعًا ومتعددًا. تساعد السياحة على تعزيز التبادل الثقافي والتفاهم بين الشعوب، وتتيح للناس التعرف على عادات وتقاليد مختلفة. رغم فوائدها، قد تخلق السياحة تحديات بيئية واجتماعية إذا لم تتم بشكل مستدام"),
    CategoryData(title: 'مجلة الصحة', Image: 'assets/images/health.png',discrib:"الصحة هي حالة من الرفاهية الجسدية والعقلية والاجتماعية، وليست مجرد غياب المرض. تعد التغذية السليمة، والتمارين الرياضية، والنوم الجيد من الأسس التي تحافظ على صحة الجسم. تلعب الوقاية من الأمراض دورًا كبيرًا في الحفاظ على الصحة، من خلال الفحوصات الدورية والتطعيمات. كما أن الصحة النفسية مهمة بنفس قدر الصحة الجسدية، حيث تؤثر التوترات والضغوطات على الجسم والعقل. في النهاية، الصحة الجيدة تعزز من جودة الحياة وتمكن الأفراد من تحقيق أهدافهم والعيش بسعادة" ),
    CategoryData(title: 'مجلة حواء', Image: 'assets/images/hawaa.jpg',discrib: "حواء هي رمز للأمومة والأنوثة في الكثير من الثقافات، وهي أول امرأة في التاريخ وفقًا للعديد من المعتقدات الدينية. تمثل حواء القوة والرحمة، وتُعتبر مصدرًا للإلهام في مجالات متعددة مثل الأسرة والمجتمع. لعبت النساء عبر التاريخ دورًا محوريًا في بناء المجتمعات وتقدمها، وتعتبر حواء رمزًا لذلك الدور المهم. رغم التحديات التي واجهتها المرأة عبر العصور، إلا أنها أثبتت قدرتها على التكيف والنمو. حواء هي جزء من الهوية الإنسانية، حيث تعكس جوانب من الحياة المتنوعة والمعقدة التي تعيشها النساء"),
    CategoryData(title: 'مجلة الاقتصاد', Image: 'assets/images/economy.jpg',discrib: "الاقتصاد هو علم دراسة الموارد وكيفية توزيعها واستخدامها لتلبية احتياجات الأفراد والمجتمعات. يتضمن الاقتصاد العديد من المجالات مثل الإنتاج، الاستهلاك، التجارة، والتوظيف. يؤثر الاقتصاد بشكل كبير في حياة الأفراد من خلال تأثيره على مستوى الدخل وفرص العمل. يشمل الاقتصاد أيضًا السياسات الحكومية التي تهدف إلى تحسين مستوى المعيشة وتحقيق النمو الاقتصادي المستدام. في عالم متغير، يواجه الاقتصاد تحديات مثل التضخم والبطالة، ولكنه يبقى محركًا أساسيًا لتحقيق التقدم والتطور في المجتمعات"),
    CategoryData(title: 'مجلة السيارات', Image: 'assets/images/cars.jpg',discrib: "السيارات هي وسائل نقل حديثة أسهمت بشكل كبير في تسهيل التنقل وحركة الأشخاص والبضائع. منذ اختراع أول سيارة في أواخر القرن التاسع عشر، شهدت السيارات تطورًا كبيرًا من حيث التصميم والتكنولوجيا. أصبحت السيارات الآن مزودة بأنظمة متقدمة مثل القيادة الذاتية، والأنظمة الذكية، والمحركات الكهربائية. تساهم صناعة السيارات في الاقتصاد العالمي من خلال توفير فرص العمل ودفع عجلة الابتكار. ومع ذلك، فإن زيادة عدد السيارات يفرض تحديات بيئية مثل تلوث الهواء وحاجة المدن إلى بنية تحتية مناسبة."),
    CategoryData(title: 'مجلة الطهي', Image: 'assets/images/coocking.jpg',discrib: "الطهي هو فن وعلم تحويل المكونات الخام إلى أطباق لذيذة باستخدام الحرارة وتقنيات مختلفة. يعد من أهم الأنشطة اليومية التي تجمع بين الإبداع والمهارة، حيث يعكس ثقافة الشعوب وتقاليدها. يشمل الطهي تحضير الأطعمة بطرق متنوعة مثل السلق، القلي، الخَبز، والشواء. كما يعتبر الطهي وسيلة للتعبير عن الذات والتمتع بالطعام الصحي والمتوازن. من خلال الطهي، يمكن للمرء استكشاف نكهات جديدة والتعرف على تقنيات المطبخ العالمية"),
    CategoryData(title: 'مجلة المعرفة', Image: 'assets/images/knowledg.jpg',discrib:"المعرفة هي القوة التي تمكن الإنسان من فهم العالم من حوله واتخاذ قرارات مدروسة. هي نتاج التعلم والتجربة، وتتراكم عبر الزمن من خلال البحث والتفاعل مع البيئة. تعتبر المعرفة أساس التطور في جميع المجالات، سواء كانت علمية أو ثقافية أو اجتماعية. إنها تساهم في تحسين جودة الحياة ورفع مستوى الوعي الفردي والجماعي. من خلال تبادل المعرفة، يمكن للمجتمعات بناء مستقبل أفضل وأكثر تقدمًا" ),
    CategoryData(title: ' مجلة السياسة', Image: 'assets/images/policy.jpg',discrib: "السياسة هي فن إدارة شؤون الدولة والمجتمع، وهي تتعلق بكيفية اتخاذ القرارات التي تؤثر في حياة الناس وتوجيه موارد الدولة. تشمل السياسة العلاقات بين الحكومات، وكذلك تفاعلات الأفراد والمؤسسات داخل المجتمع. تُعتبر الديمقراطية أحد أشكال السياسة التي تتيح للشعب المشاركة في صنع القرارات عبر الانتخابات. بينما تركز الأنظمة الاستبدادية على تركيز السلطة في يد القائد أو الحكومة. تلعب السياسة دورًا حيويًا في تحقيق الاستقرار والعدالة، ولكنها قد تؤدي أيضًا إلى صراعات وتوترات بين القوى المختلفة في المجتمع"),
    CategoryData(title: 'مجلة التكنولوجيا', Image: 'assets/images/tecnology.jpg',discrib: "التكنولوجيا هي مجموعة من الأدوات والتقنيات التي تم تطويرها لتحسين حياة الإنسان وتسهيل مهامه اليومية. بدأت مع اختراع الأدوات البسيطة وتطورت مع مرور الوقت لتشمل أجهزة الكمبيوتر والإنترنت والذكاء الاصطناعي. أحدثت التكنولوجيا ثورة في مجالات مثل الاتصالات، التعليم، الطب، والصناعة، حيث جعلت المعلومات أكثر توافرًا وساهمت في تحسين الإنتاجية. رغم فوائدها العديدة، فإن التكنولوجيا تطرح تحديات مثل فقدان الخصوصية وزيادة الاعتماد على الأجهزة. تظل التكنولوجيا قوة محورية في تقدم المجتمعات، مما يعكس دورها الحيوي في العصر الحديث"),
    CategoryData(title: "مجلة الرياضة", Image: 'assets/images/sport.jpg',discrib: "الرياضة هي نشاط بدني يمارسه الأفراد لتحسين لياقتهم البدنية والصحية، كما تعد وسيلة للتسلية والترفيه. تلعب الرياضة دورًا مهمًا في تعزيز الروح الجماعية والروح الرياضية، حيث تجمع بين الأفراد من مختلف الأعمار والخلفيات الثقافية. تشمل الرياضة العديد من الأنواع مثل كرة القدم، السباحة، والتنس، مما يسمح بتنوع الأنشطة التي يمكن ممارستها. تساعد الرياضة على تقوية الجسم والعقل، وتقلل من مخاطر الأمراض المزمنة مثل السكري وأمراض القلب. إلى جانب ذلك، تشجع الرياضة على الانضباط والالتزام، مما يجعلها جزءًا أساسيًا من حياة الإنسان المعاصر"),
    CategoryData(title: 'مجلة السياحة', Image: 'assets/images/tourism.jpg',discrib:"السياحة هي نشاط يقوم به الأفراد لزيارة أماكن جديدة بغرض الترفيه أو الاستكشاف أو الاستجمام. تعد السياحة مصدرًا هامًا للدخل للكثير من البلدان، حيث تساهم في تنمية الاقتصاد المحلي وتوفير فرص العمل. تشمل السياحة العديد من الأنواع مثل السياحة الثقافية، الشاطئية، والطبيعية، مما يجعلها مجالًا واسعًا ومتعددًا. تساعد السياحة على تعزيز التبادل الثقافي والتفاهم بين الشعوب، وتتيح للناس التعرف على عادات وتقاليد مختلفة. رغم فوائدها، قد تخلق السياحة تحديات بيئية واجتماعية إذا لم تتم بشكل مستدام" ),
    CategoryData(title: 'مجلة الصحة', Image: 'assets/images/health.png',discrib: "الصحة هي حالة من الرفاهية الجسدية والعقلية والاجتماعية، وليست مجرد غياب المرض. تعد التغذية السليمة، والتمارين الرياضية، والنوم الجيد من الأسس التي تحافظ على صحة الجسم. تلعب الوقاية من الأمراض دورًا كبيرًا في الحفاظ على الصحة، من خلال الفحوصات الدورية والتطعيمات. كما أن الصحة النفسية مهمة بنفس قدر الصحة الجسدية، حيث تؤثر التوترات والضغوطات على الجسم والعقل. في النهاية، الصحة الجيدة تعزز من جودة الحياة وتمكن الأفراد من تحقيق أهدافهم والعيش بسعادة"),
    CategoryData(title: 'مجلة حواء', Image: 'assets/images/hawaa.jpg',discrib: "حواء هي رمز للأمومة والأنوثة في الكثير من الثقافات، وهي أول امرأة في التاريخ وفقًا للعديد من المعتقدات الدينية. تمثل حواء القوة والرحمة، وتُعتبر مصدرًا للإلهام في مجالات متعددة مثل الأسرة والمجتمع. لعبت النساء عبر التاريخ دورًا محوريًا في بناء المجتمعات وتقدمها، وتعتبر حواء رمزًا لذلك الدور المهم. رغم التحديات التي واجهتها المرأة عبر العصور، إلا أنها أثبتت قدرتها على التكيف والنمو. حواء هي جزء من الهوية الإنسانية، حيث تعكس جوانب من الحياة المتنوعة والمعقدة التي تعيشها النساء"),
    CategoryData(title: 'مجلة الاقتصاد', Image: 'assets/images/economy.jpg',discrib: "الاقتصاد هو علم دراسة الموارد وكيفية توزيعها واستخدامها لتلبية احتياجات الأفراد والمجتمعات. يتضمن الاقتصاد العديد من المجالات مثل الإنتاج، الاستهلاك، التجارة، والتوظيف. يؤثر الاقتصاد بشكل كبير في حياة الأفراد من خلال تأثيره على مستوى الدخل وفرص العمل. يشمل الاقتصاد أيضًا السياسات الحكومية التي تهدف إلى تحسين مستوى المعيشة وتحقيق النمو الاقتصادي المستدام. في عالم متغير، يواجه الاقتصاد تحديات مثل التضخم والبطالة، ولكنه يبقى محركًا أساسيًا لتحقيق التقدم والتطور في المجتمعات"),
    CategoryData(title: 'مجلة السيارات', Image: 'assets/images/cars.jpg',discrib:"السيارات هي وسائل نقل حديثة أسهمت بشكل كبير في تسهيل التنقل وحركة الأشخاص والبضائع. منذ اختراع أول سيارة في أواخر القرن التاسع عشر، شهدت السيارات تطورًا كبيرًا من حيث التصميم والتكنولوجيا. أصبحت السيارات الآن مزودة بأنظمة متقدمة مثل القيادة الذاتية، والأنظمة الذكية، والمحركات الكهربائية. تساهم صناعة السيارات في الاقتصاد العالمي من خلال توفير فرص العمل ودفع عجلة الابتكار. ومع ذلك، فإن زيادة عدد السيارات يفرض تحديات بيئية مثل تلوث الهواء وحاجة المدن إلى بنية تحتية مناسبة." ),
    CategoryData(title: 'مجلة الطهي', Image: 'assets/images/coocking.jpg',discrib:"الطهي هو فن وعلم تحويل المكونات الخام إلى أطباق لذيذة باستخدام الحرارة وتقنيات مختلفة. يعد من أهم الأنشطة اليومية التي تجمع بين الإبداع والمهارة، حيث يعكس ثقافة الشعوب وتقاليدها. يشمل الطهي تحضير الأطعمة بطرق متنوعة مثل السلق، القلي، الخَبز، والشواء. كما يعتبر الطهي وسيلة للتعبير عن الذات والتمتع بالطعام الصحي والمتوازن. من خلال الطهي، يمكن للمرء استكشاف نكهات جديدة والتعرف على تقنيات المطبخ العالمية" ),
    CategoryData(title: 'مجلة المعرفة', Image: 'assets/images/knowledg.jpg',discrib:"المعرفة هي القوة التي تمكن الإنسان من فهم العالم من حوله واتخاذ قرارات مدروسة. هي نتاج التعلم والتجربة، وتتراكم عبر الزمن من خلال البحث والتفاعل مع البيئة. تعتبر المعرفة أساس التطور في جميع المجالات، سواء كانت علمية أو ثقافية أو اجتماعية. إنها تساهم في تحسين جودة الحياة ورفع مستوى الوعي الفردي والجماعي. من خلال تبادل المعرفة، يمكن للمجتمعات بناء مستقبل أفضل وأكثر تقدمًا" ),

  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          backgroundColor: Color(0x553CABFF),
          title: Container(
              decoration: BoxDecoration(
                  color: Color(0x432561FF),
                  borderRadius: BorderRadius.circular(15)
              ),
              padding: EdgeInsets.all(10),
              child: Text('Flutter c13')),
          leading: Icon(
              size: 40,
              Icons.access_time_filled,
              color: Color(0xFF402D67)
          ),
          actions: [
            Icon(
                size: 30,
                Icons.search,
                color: Color(0xFF402D67)
            ),
            Icon(
                size: 30,
                Icons.menu,
                color: Color(0xFF402D67)
            )
          ],
        ),
        body: Column(
          children: [
            Row(
              children: [
                HeadLines('الأخبار'),
                SizedBox(
                  width: 10,
                ),
                HeadLines('المجلات')
              ],
            ),
            Expanded(
              child: GridView.builder(
                itemCount: data.length,
                  gridDelegate: SliverGridDelegateWithFixedCrossAxisCount(
                      crossAxisCount: 2,
                  childAspectRatio: 3/2,
                  crossAxisSpacing: 5),
                  itemBuilder: PathWordfung
              ),
            ),
          ],
        )
    );
  }
PathWord PathWordfung(BuildContext context, int position){
    return PathWord(inform:data[position],onTap: (){
      Navigator.of(context)
          .pushNamed(CategoryData.pages,arguments: data[position]);
    }, );
}
  Widget PathWordfun(BuildContext context, int position) {
    CategoryData first = data[position * 2];
    CategoryData? seconed = (position * 2 + 1 < data.length)
        ?data[position*2+1]:null;

    return Row(mainAxisAlignment: MainAxisAlignment.start,
      children: [
        PathWord(inform: first,onTap:(){
          Navigator.of(context)
              .pushNamed(CategoryData.pages,arguments: data[position]);
        }, ),
        SizedBox(width: 5,),
        if(seconed!=null) PathWord(inform: seconed,onTap: (){
          Navigator.of(context)
              .pushNamed(CategoryData.pages,arguments: data[position]);
        },)
      ],
    );

  }
}



